
//ProductData.js
import naseem from '../images/naseem.jpeg';
import sabra from '../images/sabra.png';
import fe from '../images/fe.jpeg';

const products = [
  {
    id: '1',
    name: 'صبرا',
    imageUrl: sabra,
    description: ' نبات صبار صغير مزين بزهور حمراء اللون، تعتبر الصبارات الصغيرة من النباتات التي تضم عدد كبير ومختلف من حيث الشكل والحجم، كما أنها صبورة جداً ولاتحتاج للكثير من العناية، يمكن وضعها في المنازل أو بيئات العمل المختلفة.',
  },
  {
    id: '2',
    name: 'فيّ',
    imageUrl: fe,
    description: 'نبات صبار صغير مزين بزهور حمراء اللون، تعتبر الصبارات الصغيرة من النباتات التي تضم عدد كبير ومختلف من حيث الشكل والحجم، كما أنها صبورة جداً ولاتحتاج للكثير من العناية، يمكن وضعها في المنازل أو بيئات العمل المختلفة.',
  },
  {
    id: '3',
    name: 'نسيم',
    imageUrl: naseem,
    description: 'نبتة بونساي في حوض رخام. جميل وأنيق ومناسب للطاولات الجانبية أو بجانب طاولة التلفزيون.',
  },
];

export default products;
